src/main/java/ok/dht/test/yasevich/profiling/stage3/wrk/wrk-get-report1_2
Running 1m test @ http://localhost:12353
  8 threads and 64 connections
  Thread calibration: mean lat.: 362.239ms, rate sampling interval: 1501ms
  Thread calibration: mean lat.: 430.000ms, rate sampling interval: 1684ms
  Thread calibration: mean lat.: 455.329ms, rate sampling interval: 1727ms
  Thread calibration: mean lat.: 271.940ms, rate sampling interval: 1061ms
  Thread calibration: mean lat.: 357.657ms, rate sampling interval: 1651ms
  Thread calibration: mean lat.: 377.329ms, rate sampling interval: 1731ms
  Thread calibration: mean lat.: 253.393ms, rate sampling interval: 1037ms
  Thread calibration: mean lat.: 457.718ms, rate sampling interval: 1785ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.37s     1.60s    7.64s    67.04%
    Req/Sec     4.07k    94.35     4.33k    67.78%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.97s 
 75.000%    3.42s 
 90.000%    4.80s 
 99.000%    6.41s 
 99.900%    7.31s 
 99.990%    7.57s 
 99.999%    7.64s 
100.000%    7.65s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.069     0.000000            2         1.00
     588.799     0.100000       162179         1.11
     949.247     0.200000       324500         1.25
    1267.711     0.300000       486577         1.43
    1605.631     0.400000       648861         1.67
    1967.103     0.500000       810683         2.00
    2187.263     0.550000       891732         2.22
    2439.167     0.600000       973025         2.50
    2740.223     0.650000      1054012         2.86
    3045.375     0.700000      1135280         3.33
    3418.111     0.750000      1216193         4.00
    3606.527     0.775000      1256684         4.44
    3831.807     0.800000      1297321         5.00
    4040.703     0.825000      1337777         5.71
    4284.415     0.850000      1378650         6.67
    4542.463     0.875000      1418611         8.00
    4677.631     0.887500      1439185         8.89
    4800.511     0.900000      1459211        10.00
    4968.447     0.912500      1479632        11.43
    5148.671     0.925000      1499657        13.33
    5304.319     0.937500      1520416        16.00
    5390.335     0.943750      1530406        17.78
    5484.543     0.950000      1540343        20.00
    5582.847     0.956250      1550378        22.86
    5693.439     0.962500      1560582        26.67
    5808.127     0.968750      1570606        32.00
    5877.759     0.971875      1575683        35.56
    5951.487     0.975000      1580884        40.00
    6025.215     0.978125      1586014        45.71
    6103.039     0.981250      1590961        53.33
    6193.151     0.984375      1596181        64.00
    6242.303     0.985938      1598535        71.11
    6311.935     0.987500      1600984        80.00
    6377.471     0.989062      1603599        91.43
    6430.719     0.990625      1606085       106.67
    6500.351     0.992188      1608681       128.00
    6541.311     0.992969      1609908       142.22
    6598.655     0.993750      1611243       160.00
    6635.519     0.994531      1612408       182.86
    6668.287     0.995313      1613711       213.33
    6717.439     0.996094      1615023       256.00
    6737.919     0.996484      1615553       284.44
    6807.551     0.996875      1616222       320.00
    6852.607     0.997266      1616854       365.71
    6893.567     0.997656      1617473       426.67
    6991.871     0.998047      1618160       512.00
    7012.351     0.998242      1618403       568.89
    7057.407     0.998437      1618725       640.00
    7094.271     0.998633      1619040       731.43
    7188.479     0.998828      1619355       853.33
    7323.647     0.999023      1619664      1024.00
    7393.279     0.999121      1619851      1137.78
    7426.047     0.999219      1619993      1280.00
    7442.431     0.999316      1620151      1462.86
    7462.911     0.999414      1620304      1706.67
    7483.391     0.999512      1620457      2048.00
    7487.487     0.999561      1620550      2275.56
    7491.583     0.999609      1620621      2560.00
    7495.679     0.999658      1620711      2925.71
    7499.775     0.999707      1620803      3413.33
    7503.871     0.999756      1620886      4096.00
    7507.967     0.999780      1620935      4551.11
    7507.967     0.999805      1620935      5120.00
    7532.543     0.999829      1620973      5851.43
    7548.927     0.999854      1621017      6826.67
    7561.215     0.999878      1621062      8192.00
    7565.311     0.999890      1621083      9102.22
    7569.407     0.999902      1621095     10240.00
    7577.599     0.999915      1621118     11702.86
    7585.791     0.999927      1621131     13653.33
    7598.079     0.999939      1621168     16384.00
    7598.079     0.999945      1621168     18204.44
    7598.079     0.999951      1621168     20480.00
    7602.175     0.999957      1621189     23405.71
    7602.175     0.999963      1621189     27306.67
    7614.463     0.999969      1621199     32768.00
    7618.559     0.999973      1621204     36408.89
    7622.655     0.999976      1621212     40960.00
    7626.751     0.999979      1621222     46811.43
    7626.751     0.999982      1621222     54613.33
    7630.847     0.999985      1621226     65536.00
    7630.847     0.999986      1621226     72817.78
    7634.943     0.999988      1621228     81920.00
    7639.039     0.999989      1621232     93622.86
    7643.135     0.999991      1621241    109226.67
    7643.135     0.999992      1621241    131072.00
    7643.135     0.999993      1621241    145635.56
    7643.135     0.999994      1621241    163840.00
    7643.135     0.999995      1621241    187245.71
    7643.135     0.999995      1621241    218453.33
    7643.135     0.999996      1621241    262144.00
    7647.231     0.999997      1621247    291271.11
    7647.231     1.000000      1621247          inf
#[Mean    =     2365.435, StdDeviation   =     1596.721]
#[Max     =     7643.136, Total count    =      1621247]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1949476 requests in 1.00m, 120.87MB read
  Non-2xx or 3xx responses: 965060
Requests/sec:  32491.79
Transfer/sec:      2.01MB