src/main/java/ok/dht/test/yasevich/profiling/stage3/wrk/wrk-put-report1
Running 1m test @ http://localhost:12353
  8 threads and 64 connections
  Thread calibration: mean lat.: 5.286ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 5.106ms, rate sampling interval: 21ms
  Thread calibration: mean lat.: 4.692ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 5.630ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 5.188ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 6.010ms, rate sampling interval: 27ms
  Thread calibration: mean lat.: 5.071ms, rate sampling interval: 23ms
  Thread calibration: mean lat.: 5.381ms, rate sampling interval: 23ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    40.44ms  117.27ms   1.16s    92.55%
    Req/Sec     5.07k   666.53     9.17k    72.36%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.92ms
 75.000%   13.67ms
 90.000%  101.50ms
 99.000%  663.55ms
 99.900%  971.26ms
 99.990%    1.13s 
 99.999%    1.16s 
100.000%    1.16s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.020     0.000000            1         1.00
       0.805     0.100000       198119         1.11
       1.235     0.200000       396164         1.25
       1.759     0.300000       594203         1.43
       2.645     0.400000       792118         1.67
       3.915     0.500000       989979         2.00
       4.723     0.550000      1089013         2.22
       5.819     0.600000      1188030         2.50
       7.383     0.650000      1287055         2.86
       9.727     0.700000      1386198         3.33
      13.671     0.750000      1484925         4.00
      16.767     0.775000      1534577         4.44
      21.279     0.800000      1584025         5.00
      28.447     0.825000      1633467         5.71
      40.927     0.850000      1682976         6.67
      64.255     0.875000      1732412         8.00
      80.895     0.887500      1757168         8.89
     101.503     0.900000      1781927        10.00
     125.759     0.912500      1806678        11.43
     156.671     0.925000      1831426        13.33
     191.999     0.937500      1856160        16.00
     215.423     0.943750      1868569        17.78
     241.663     0.950000      1880903        20.00
     276.735     0.956250      1893328        22.86
     314.623     0.962500      1905654        26.67
     363.007     0.968750      1918072        32.00
     391.679     0.971875      1924215        35.56
     423.167     0.975000      1930418        40.00
     461.311     0.978125      1936589        45.71
     500.991     0.981250      1942791        53.33
     543.743     0.984375      1948980        64.00
     584.703     0.985938      1952082        71.11
     611.327     0.987500      1955189        80.00
     649.727     0.989062      1958257        91.43
     672.767     0.990625      1961393       106.67
     708.607     0.992188      1964445       128.00
     726.527     0.992969      1965977       142.22
     746.495     0.993750      1967547       160.00
     780.287     0.994531      1969072       182.86
     814.591     0.995313      1970654       213.33
     840.703     0.996094      1972171       256.00
     858.623     0.996484      1972943       284.44
     872.447     0.996875      1973714       320.00
     894.463     0.997266      1974494       365.71
     908.287     0.997656      1975277       426.67
     928.255     0.998047      1976042       512.00
     939.007     0.998242      1976428       568.89
     949.759     0.998437      1976812       640.00
     957.439     0.998633      1977199       731.43
     964.607     0.998828      1977595       853.33
     972.287     0.999023      1977973      1024.00
     978.431     0.999121      1978156      1137.78
     986.623     0.999219      1978354      1280.00
    1000.447     0.999316      1978545      1462.86
    1015.295     0.999414      1978736      1706.67
    1028.607     0.999512      1978929      2048.00
    1035.775     0.999561      1979026      2275.56
    1048.063     0.999609      1979123      2560.00
    1069.055     0.999658      1979223      2925.71
    1077.247     0.999707      1979316      3413.33
    1090.559     0.999756      1979416      4096.00
    1094.655     0.999780      1979465      4551.11
    1098.751     0.999805      1979515      5120.00
    1102.847     0.999829      1979559      5851.43
    1105.919     0.999854      1979613      6826.67
    1108.991     0.999878      1979664      8192.00
    1111.039     0.999890      1979678      9102.22
    1129.471     0.999902      1979706     10240.00
    1132.543     0.999915      1979730     11702.86
    1138.687     0.999927      1979753     13653.33
    1145.855     0.999939      1979777     16384.00
    1146.879     0.999945      1979787     18204.44
    1148.927     0.999951      1979808     20480.00
    1149.951     0.999957      1979819     23405.71
    1150.975     0.999963      1979831     27306.67
    1151.999     0.999969      1979841     32768.00
    1151.999     0.999973      1979841     36408.89
    1154.047     0.999976      1979854     40960.00
    1154.047     0.999979      1979854     46811.43
    1155.071     0.999982      1979862     54613.33
    1156.095     0.999985      1979871     65536.00
    1156.095     0.999986      1979871     72817.78
    1156.095     0.999988      1979871     81920.00
    1157.119     0.999989      1979879     93622.86
    1157.119     0.999991      1979879    109226.67
    1158.143     0.999992      1979883    131072.00
    1158.143     0.999993      1979883    145635.56
    1158.143     0.999994      1979883    163840.00
    1159.167     0.999995      1979889    187245.71
    1159.167     0.999995      1979889    218453.33
    1159.167     0.999996      1979889    262144.00
    1159.167     0.999997      1979889    291271.11
    1159.167     0.999997      1979889    327680.00
    1160.191     0.999997      1979892    374491.43
    1160.191     0.999998      1979892    436906.67
    1160.191     0.999998      1979892    524288.00
    1160.191     0.999998      1979892    582542.22
    1160.191     0.999998      1979892    655360.00
    1161.215     0.999999      1979893    748982.86
    1161.215     0.999999      1979893    873813.33
    1162.239     0.999999      1979895   1048576.00
    1162.239     1.000000      1979895          inf
#[Mean    =       40.443, StdDeviation   =      117.270]
#[Max     =     1161.216, Total count    =      1979895]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2380508 requests in 1.00m, 140.02MB read
  Non-2xx or 3xx responses: 1453
Requests/sec:  39676.08
Transfer/sec:      2.33MB